{
  "personal": {
    "name": "個人形象網站",
    "description": "適合個人、自由工作者、專業人士的形象網站",
    "pages": [
      {
        "id": "main-1",
        "chineseName": "首頁",
        "englishName": "home",
        "textContent": "包含個人簡介、專業領域、最新作品/文章/動態等。建議放置清晰的個人照片和簡潔有力的自我介紹，以及社交媒體連結。",
        "styleDescription": "簡潔現代風格，大圖背景，突出個人名字和專業領域。配色建議使用2-3種主色調，字體清晰易讀。導航區塊固定在頂部，確保訪客可以輕鬆找到所需頁面。"
      },
      {
        "id": "main-1-1",
        "chineseName": "關於我",
        "englishName": "about",
        "textContent": "詳細的個人經歷、教育背景、專業技能、價值觀等。可包含個人成長故事、職業轉變、專業認證等內容，以及個人愛好和興趣。",
        "styleDescription": "簡潔的分段敘述，搭配適當的圖片或圖表呈現專業技能。可使用時間軸展示重要的職業和教育里程碑。確保段落間有足夠留白，增強可讀性。"
      },
      {
        "id": "main-1-2",
        "chineseName": "作品集",
        "englishName": "portfolio",
        "textContent": "展示您最好的作品，每個作品需包含簡短描述、創作背景、使用的技術/工具以及成果。可按類別或時間排序。",
        "styleDescription": "網格或瀑布流排版，點擊後可查看作品詳情。每個作品縮圖需有統一尺寸，確保整體視覺協調。建議使用光箱(Lightbox)效果展示大圖，並提供作品之間的導航功能。"
      },
      {
        "id": "main-1-3",
        "chineseName": "部落格",
        "englishName": "blog",
        "textContent": "分享您的專業見解、行業動態、創作心得等文章。每篇文章需有標題、發布日期、摘要和分類標籤。",
        "styleDescription": "文章列表頁採用卡片式設計，顯示文章縮圖、標題、發布日期和簡短摘要。文章內容頁注重排版和可讀性，段落間距適中，圖文並茂。提供分類和標籤過濾功能，以及文章搜索功能。"
      },
      {
        "id": "main-1-4",
        "chineseName": "聯絡方式",
        "englishName": "contact",
        "textContent": "提供您的聯絡表單、電子郵件、電話號碼、工作室地址(如有)等。說明您的服務範圍、合作方式和回覆時間。",
        "styleDescription": "簡潔的聯絡表單，包含姓名、電子郵件、主旨和訊息欄位。表單下方可放置常見問題解答。提供社交媒體圖標，方便訪客透過不同管道聯繫您。可考慮加入Google地圖顯示位置。"
      }
    ]
  },
  "brand": {
    "name": "品牌形象網站",
    "description": "適合中小企業、工作室、設計公司的品牌展示",
    "pages": [
      {
        "id": "main-1",
        "chineseName": "首頁",
        "englishName": "home",
        "textContent": "包含品牌口號、核心價值、服務亮點和最新消息/案例。展示品牌獨特性和專業形象，並引導訪客了解更多。",
        "styleDescription": "大氣現代風格，頂部使用全屏輪播展示品牌形象或產品亮點。品牌標誌和導航清晰可見，色彩應與品牌視覺一致。頁面分區明確，每區關注一個主題，如服務、案例、客戶見證等。"
      },
      {
        "id": "main-1-1",
        "chineseName": "關於我們",
        "englishName": "about",
        "textContent": "品牌故事、創辦理念、團隊介紹、公司歷程、企業文化等。展現品牌背後的人物和故事，增強與客戶的情感連結。",
        "styleDescription": "以時間軸展示公司發展歷程，團隊成員使用統一風格的照片和簡介。加入辦公環境或工作場景照片，展現企業文化。可考慮使用視頻介紹創始人理念或辦公環境。"
      },
      {
        "id": "main-1-2",
        "chineseName": "服務項目",
        "englishName": "services",
        "textContent": "詳細介紹所提供的服務內容、服務流程、收費模式和服務優勢。針對不同客戶需求，提供對應的解決方案。",
        "styleDescription": "每項服務使用獨立卡片或區塊展示，配以相關圖標增強視覺識別。清晰列出服務流程步驟，幫助客戶了解合作方式。可加入常見問題解答，解除潛在客戶疑慮。"
      },
      {
        "id": "main-1-3",
        "chineseName": "作品案例",
        "englishName": "works",
        "textContent": "展示最佳案例，每個案例需包含:客戶需求、解決方案、實施過程、最終成果和客戶反饋。按行業或服務類型分類。",
        "styleDescription": "案例使用網格布局，點擊後進入詳情頁。每個案例配有高質量的成果圖片，並清晰描述解決方案。提供案例篩選功能，讓訪客快速找到相關案例。可考慮加入客戶見證或項目數據展示成效。"
      },
      {
        "id": "main-1-4",
        "chineseName": "新聞動態",
        "englishName": "news",
        "textContent": "分享公司最新消息、行業見解、活動報導等。展示公司的專業度和活躍度，增強品牌公信力。",
        "styleDescription": "新聞列表按時間倒序排列，顯示標題、發布日期、分類和簡短摘要。內容頁注重排版和閱讀體驗，提供相關新聞推薦。可加入訂閱新聞郵件功能，增強用戶黏性。"
      },
      {
        "id": "main-1-5",
        "chineseName": "聯絡我們",
        "englishName": "contact",
        "textContent": "提供完整聯絡信息：地址、電話、郵箱、社交媒體等。明確說明服務區域、營業時間和聯繫方式。",
        "styleDescription": "整潔的聯絡表單，包含姓名、公司、聯絡方式、需求描述等欄位。表單旁邊顯示公司地址和Google地圖。提供多種聯絡渠道，包括社交媒體和即時通訊工具。可考慮加入常見問題解答區塊。"
      }
    ]
  },
  "ecommerce": {
    "name": "商品銷售網站",
    "description": "適合線上銷售產品、經營電商的網站結構",
    "pages": [
      {
        "id": "main-1",
        "chineseName": "首頁",
        "englishName": "home",
        "textContent": "展示熱門商品、促銷活動、新品上市、季節性推薦等。突出品牌特色和價值主張，並引導用戶瀏覽商品。",
        "styleDescription": "清晰的導航系統，顯眼的搜索欄和購物車入口。輪播區展示主打商品或促銷活動，下方可分類展示熱銷商品、新品和限時特惠等。頁面底部提供新聞訂閱、支付方式和快速導航。"
      },
      {
        "id": "main-1-1",
        "chineseName": "商品分類",
        "englishName": "categories",
        "textContent": "按照產品類別、系列、用途等進行分類展示。每個分類頁面應有簡短介紹，說明該類別的特點和適用人群。",
        "styleDescription": "左側為分類篩選區，包含價格區間、顏色、尺寸、材質等篩選選項。右側為商品網格展示，可切換列表或網格視圖。每個商品卡片顯示名稱、價格、評分和「加入購物車」按鈕。提供排序功能(熱門、價格、最新等)。"
      },
      {
        "id": "main-1-1-1",
        "chineseName": "商品詳情",
        "englishName": "product",
        "textContent": "詳細介紹單個商品的特點、規格、材質、尺寸、使用方法等。提供豐富的商品描述和多角度高清圖片，幫助客戶做出購買決定。",
        "styleDescription": "左側為商品圖片展示，可放大和切換不同角度。右側為商品信息，包含名稱、價格、評分、庫存狀態、規格選擇和數量選擇。下方為詳細描述區，分頁展示商品描述、規格參數、使用說明和客戶評價。提供「加入購物車」和「立即購買」按鈕，以及分享和收藏功能。"
      },
      {
        "id": "main-1-2",
        "chineseName": "購物車",
        "englishName": "cart",
        "textContent": "顯示已選商品清單，包含商品圖片、名稱、單價、數量、小計等。提供修改數量、刪除商品、應用優惠券和計算總價的功能。",
        "styleDescription": "清晰的表格式布局，每件商品一行，顯示基本信息和操作按鈕。提供數量調整器和刪除按鈕。頁面右側或底部顯示訂單摘要，包含商品總價、運費、稅費和最終應付金額。醒目的「結帳」按鈕和「繼續購物」選項。"
      },
      {
        "id": "main-1-3",
        "chineseName": "結帳流程",
        "englishName": "checkout",
        "textContent": "包含填寫收件信息、選擇配送方式、選擇支付方式和確認訂單等步驟。流程應簡潔明了，減少客戶中途放棄的可能性。",
        "styleDescription": "分步驟顯示結帳流程，突出當前步驟。表單設計簡潔，必填項明確標注。提供地址自動填充功能。配送方式和支付方式使用卡片式選擇。最後一步顯示完整訂單確認，包含所有商品和費用明細。購買按鈕顯眼且易於點擊。"
      },
      {
        "id": "main-1-4",
        "chineseName": "會員中心",
        "englishName": "account",
        "textContent": "提供訂單查詢、個人資料管理、收件地址管理、優惠券管理、願望清單等功能。增強用戶體驗和忠誠度。",
        "styleDescription": "側邊導航列出各功能區塊。訂單管理頁面顯示訂單狀態、時間和金額，可點擊查看詳情。個人資料頁面提供表單修改個人信息和密碼。地址管理頁面可添加、編輯和刪除多個收件地址。願望清單以網格方式展示收藏商品，可直接添加到購物車。"
      },
      {
        "id": "main-1-5",
        "chineseName": "品牌故事",
        "englishName": "about",
        "textContent": "介紹品牌理念、發展歷程、品質承諾和社會責任等。增強品牌形象和消費者信任度。",
        "styleDescription": "大氣的品牌故事頁面，搭配高質量圖片或視頻。使用時間軸展示品牌發展里程碑。強調品牌價值觀和獨特賣點。可加入創始人或團隊介紹，增強品牌親和力。提供品牌媒體報導或獎項展示，提升公信力。"
      },
      {
        "id": "main-1-6",
        "chineseName": "常見問題",
        "englishName": "faq",
        "textContent": "解答客戶常見疑問，如商品尺寸選擇、退換貨政策、配送時間、支付方式等。減少客服負擔，提高購物體驗。",
        "styleDescription": "分類列出常見問題，使用手風琴效果(accordion)展示問答內容。提供關鍵字搜索功能，幫助客戶快速找到所需答案。每個問題區塊可展開/收起，節省頁面空間。問題未解決時，提供聯絡客服的選項。"
      },
      {
        "id": "main-1-7",
        "chineseName": "聯絡我們",
        "englishName": "contact",
        "textContent": "提供客服郵箱、電話、在線聊天等聯絡方式。說明客服時間和回覆時效，以及門市地址(如有)。",
        "styleDescription": "清晰列出各種聯絡方式和客服時間。提供簡潔的聯絡表單，包含名稱、郵箱、訂單號(選填)、問題類型和問題描述等欄位。如有門市，提供Google地圖顯示位置。可考慮加入即時聊天功能和社群媒體連結。"
      }
    ]
  }
}